{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.6/4.3"
      ],
      "degree": "Master of Computer engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2021",
      "school_name": "Concordia university"
    },
    {
      "awards_achievements": [
        "Identified as exceptional talent Azad University, Tehran, Iran (2014)",
        "GPA: 3.62/4.3",
        "Scholarship"
      ],
      "degree": "Bachelor Electrical and Computer Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2013-2016",
      "school_name": "Azad university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NazaninAkbari",
  "highlighted_projects": [
    {
      "description": "Designed an Airline Reservation System application that enables customers to search and book the flights using C#.NET, Microsoft Azure SQL, Visual Studio, etc. Tested the system with unit tests and integration tests. Git and Github were used as the version control system. Organized Scrum processes and activities through Microsoft Azure DevOps. Flow diagrams and context diagrams are used to model different sprints.",
      "git_url": "https://github.com/Na-zi/Projects/tree/main/airline-reservation",
      "name": "Airline reservation system"
    },
    {
      "description": "Designed snake game using Python as Object-Oriented Language. The snake game has a snake that you can control by using your keyboard to grab the food. The game was developed in PyCharm.",
      "git_url": "https://github.com/Na-zi/Projects/tree/main/snake_game",
      "name": "Snake game"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent that allows a user to monitor and store hardware specifications and usage information for multiple Linux systems. The agent employs Bash Scripts to collect machine hardware information, which is then stored in a PostgreSQL database provisioned using Docker. The resource usage is fetched periodically with Crontab, and we can then manipulate the aggregated data using SQL queries.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_NazaninAkbari/tree/feature/creating-DDL/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        " Twitter App: Currently working on the project.",
        " JDBC App: Implemented basic CRUD operations. This application is a demonstration of the DAO and Repository Design patterns being implemented using JDBC (Java Database Connectivity).",
        "Grep App: Implemented Java Grep application which allows users to search text patterns from a Linux filesystem using core Java, Lambda expression, Maven, IntelliJ, Regex. Application is dockerized in container and pushed to Docker Hub."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_NazaninAkbari/tree/feature/java-apps/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Currently working on the project.",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    }
  ],
  "name": "Nazanin Akbari",
  "others": [
    {
      "bullets": [
        "Udemy Scrum certificate (2021)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Volunteer, Organise a social media group to practice French language.",
        "Volunteer, Organiser of Competitive games: Managed competitive games among university students at Concordia University."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated on a Scrum team within an Agile environment as a data engineer. Implemented software projects using a variety of technologies, such as Linux, Java, SQL, Docker, Git, and Google Cloud Platform.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "5-Azar hospital, Gorgan, Iran",
      "description": "Analyzed technical defects and implement data-driven solution with a team of engineers with engineering guidance. Prioritized workload effectively and complete all work assignments in a timely manner. Managed my team member hours to hit monthly targets while maintaining above 100% productivity are part of my roles.",
      "duration": "2016-2018",
      "title": "Biomedical Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Pandas",
      "Numpy",
      "Scikit-learn",
      "Docker",
      "IntelliJ",
      "Visual Studio",
      "Google Cloud Platform",
      "REST API"
    ],
    "familiar": [
      "Neural Network",
      "Machine Learning",
      "TensorFlow",
      "C#",
      "Azure DevOps",
      "Unit testing"
    ],
    "proficient": [
      "Python",
      "Data Science",
      "Data Structures and Algorithms",
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I graduated from Concordia University's Software Engineering program and recently joined Jarvis as a software and data engineer developing projects using Java 1.8, Maven, Python, Linux/Bash, Git, Docker, and RDBMS. During my Master's program, I spent two years developing multiple projects with Matlab, Python, and C# in different developers. I am fluent in French. I love programming and computer science because it is a language that can apply to every facet of life. My experiences have taught me how to think outside the box when developing software, and I always strive to find the most optimized solution to the problem."
}
